pvvx/esp8266web/app/sdklib/system/app_main.c
/******************************************************************************
 * FileName: app_main.c
 * Description: Alternate SDK (libmain.a)
 * Author: PV`
 * (c) PV` 2015
*******************************************************************************/
#include "sdk/sdk_config.h"
#include "bios.h"
#include "user_interface.h"
#include "hw/esp8266.h"
#include "hw/spi_register.h"
#include "hw/uart_register.h"
#include "hw/corebits.h"
#include "hw/specreg.h"
#include "sdk/fatal_errs.h"
#include "sdk/app_main.h"
#include "sdk/add_func.h"
#include "sdk/flash.h"
#include "sdk/wdt.h"
#include "lwip/init.h"
#include "lwip/netif.h"
#include "lwip/timers.h"
#include "phy/phy.h"
#include "sdk/sys_const.h"
#include "sdk/rom2ram.h"
//=============================================================================
// Define
//-----------------------------------------------------------------------------
#if defined(USE_MAX_IRAM) 
 #if USE_MAX_IRAM == 48
	#define Cache_Read_Enable_def() Cache_Read_Enable(0, 0, 0)
 #else
	#define Cache_Read_Enable_def() Cache_Read_Enable(0, 0, 1)
 #endif
#else
	#define Cache_Read_Enable_def() Cache_Read_Enable(0, 0, 1)
#endif
//=============================================================================
// Data
//-----------------------------------------------------------------------------
struct s_info info; // ip,mask,gw,mac AP, ST
ETSTimer check_timeouts_timer DATA_IRAM_ATTR; // timer_lwip
uint8 user_init_flag;

#if DEF_SDK_VERSION >= 1400
extern int chip_v6_set_chan_offset(int, int);
extern uint8 phy_rx_gain_dc_flag;
extern uint8 * phy_rx_gain_dc_table;
extern sint16 TestStaFreqCalValInput;
extern struct rst_info rst_inf;
#endif
#if DEF_SDK_VERSION >= 2000
// замена user_rf_cal_sector_set()
uint32 DATA_IRAM_ATTR rf_cal_sec; // = 128-5; // всегда 123-ий (0x7B000)
#endif

#if DEF_SDK_VERSION >= 1200
uint8 SDK_VERSION[] = {SDK_VERSION_TXT};
uint16 lwip_timer_interval;
#endif

#ifdef FIX_SDK_FLASH_SIZE
#define sdk_flash_read(f,d,s) copy_s4d1((char *)d, (void *)(f + FLASH_BASE), s )
#else
#define sdk_flash_read(f,d,s) spi_flash_read(f,d,s)
#endif

#ifdef USE_OPEN_LWIP
extern bool default_hostname; // in eagle_lwip_if.c
#endif
//=============================================================================
// Init data (flash)
//=============================================================================
//  esp_init_data_default.bin
//-----------------------------------------------------------------------------
#if DEF_SDK_VERSION >= 1420
const uint8 esp_init_data_default[128] ICACHE_RODATA_ATTR = {
	    5,    0,    4,    2,    5,    5,    5,    2,    5,    0,    4,    5,    5,    4,    5,    5,
	    4, 0xFE, 0xFD, 0xFF, 0xF0, 0xF0, 0xF0, 0xE0, 0xE0, 0xE0, 0xE1,  0xA, 0xFF, 0xFF, 0xF8,    0,
	 0xF8, 0xF8, 0x52, 0x4E, 0x4A, 0x44, 0x40, 0x38,    0,    0,    1,    1,    2,    3,    4,    5,
	    1,    0,    0,    0,    0,    0,    2,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	 0xE1,  0xA,    0,    0,    0,    0,    0,    0,    0,    0,    1, 0x93, 0x43,    0,    0,    0,
	    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	    0,    0,    1,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0
};
#elif DEF_SDK_VERSION >= 1400
const uint8 esp_init_data_default[128] ICACHE_RODATA_ATTR = {
	    5,    0,    4,    2,    5,    5,    5,    2,    5,    0,    4,    5,    5,    4,    5,    5,
	    4, 0xFE, 0xFD, 0xFF, 0xF0, 0xF0, 0xF0, 0xE0, 0xE0, 0xE0, 0xE1,  0xA, 0xFF, 0xFF, 0xF8,    0,
	 0xF8, 0xF8, 0x52, 0x4E, 0x4A, 0x44, 0x40, 0x38,    0,    0,    1,    1,    2,    3,    4,    5,
	    1,    0,    0,    0,    0,    0,    2,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	 0xE1,  0xA,    0,    0,    0,    0,    0,    0,    0,    0,    1, 0x93, 0x43,    0,    0,    0,
	    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	    3,    0,    2,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0
};
#elif DEF_SDK_VERSION >= 1200
const uint8 esp_init_data_default[128] ICACHE_RODATA_ATTR = {
	    5,    0,    4,    2,    5,    5,    5,    2,    5,    0,    4,    5,    5,    4,    5,    5,
	    4, 0xFE, 0xFD, 0xFF, 0xF0, 0xF0, 0xF0, 0xE0, 0xE0, 0xE0, 0xE1,  0xA, 0xFF, 0xFF, 0xF8,    0,
	 0xF8, 0xF8, 0x52, 0x4E, 0x4A, 0x44, 0x40, 0x38,    0,    0,    1,    1,    2,    3,    4,    5,
	    1,    0,    0,    0,    0,    0,    2,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	 0xE1,  0xA,    0,    0,    0,    0,    0,    0,    0,    0,    1, 0x93, 0x43,    0,    0,    0,
	    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,
	    3,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0,    0
};
#endif
#define esp_init_data_default_size 128
//=============================================================================
// extern funcs
//-----------------------------------------------------------------------------
//=============================================================================
// IRAM code
//-----------------------------------------------------------------------------
void call_user_start(void);
#ifdef USE_FIX_QSPI_FLASH
//=============================================================================
// Инициализация QSPI и cache
//-----------------------------------------------------------------------------
static void set_qspi_flash_cache(void)
{
	SPI0_USER |= SPI_CS_SETUP; // +1 такт перед CS = 0x80000064
	// SPI на 80 MHz
#if USE_FIX_QSPI_FLASH == 80
	GPIO_MUX_CFG |= BIT(MUX_SPI0_CLK_BIT); // QSPI = 80 MHz
	SPI0_CTRL = (SPI0_CTRL & SPI_CTRL_F_MASK) | SPI_CTRL_F80MHZ;
#else  // SPI на 40 MHz
	GPIO_MUX_CFG &= ~(1<< MUX_SPI0_CLK_BIT);
	SPI0_CTRL = (SPI0_CTRL & SPI_CTRL_F_MASK) | SPI_CTRL_F40MHZ;
#endif
#ifdef USE_ALTBOOT

#endif
	flashchip->chip_size = 512*1024; // песочница для SDK в 512 килобайт flash
	// Всё - включаем кеширование, далее можно вызывать процедуры из flash
	Cache_Read_Enable_def();
}
#else
//-----------------------------------------------------------------------------
// Установка скорости QSPI
//  0 = 40MHz, 1 = 26MHz, 2 = 20MHz, >2 = 80MHz
//-----------------------------------------------------------------------------
void sflash_something(uint32 flash_speed)
{
	//	Flash QIO80:
	//  SPI_CTRL = 0x16ab000 : QIO_MODE | TWO_BYTE_STATUS_EN | WP_REG | SHARE_BUS | ENABLE_AHB | RESANDRES | FASTRD_MODE | BIT12
	//	IOMUX_BASE = 0x305
	//  Flash QIO40:
	//	SPI_CTRL = 0x16aa101
	//	IOMUX_BASE = 0x205
	uint32 xreg = (SPI0_CTRL >> 12) << 12; //  & 0xFFFFF000
	uint32 value;
	if (flash_speed > 2) { // 80 MHz
		value = BIT(12); // 0x60000208 |= 0x1000
		GPIO_MUX_CFG |= (1<< MUX_SPI0_CLK_BIT); // HWREG(IOMUX_BASE, 0) |= BIT(8);  // 80 MHz
	}
	else { // 0:40, 1:26, 2:20 MHz // 0x101, 0x202, 0x313
		value = 1 + flash_speed + ((flash_speed + 1) << 8) + ((flash_speed >> 1)<< 4);
		xreg &= ~BIT(12);  // 0x60000208 &= 0xffffefff
		GPIO_MUX_CFG &= MUX_CFG_MASK & (~(1<< MUX_SPI0_CLK_BIT)); // HWREG(IOMUX_BASE, 0) &= ~(BIT(8));  // 0x60000800 &=  0xeff
	}
	SPI0_CTRL = xreg | value;
}
//=============================================================================
// Инициализация QSPI и cache
//-----------------------------------------------------------------------------
static void set_qspi_flash_cache(void)
{
    // Загрузка заголовка flash
    struct SPIFlashHead fhead;
    Cache_Read_Disable();
	SPI0_USER |= SPI_CS_SETUP; // +1 такт перед CS
	SPIRead(0, (uint32_t *)&fhead, sizeof(fhead));
	// Установка размера Flash от 256Kbytes до 32Mbytes
	// High four bits fhead.hsz.flash_size: 0 = 512K, 1 = 256K, 2 = 1M, 3 = 2M, 4 = 4M, ... 7 = 32M
    uint32 fsize = fhead.hsz.flash_size & 7;
	if(fsize < 2) flashchip->chip_size = (8 >> fsize) << 16;
	else flashchip->chip_size = (4 << fsize) << 16;
    uint32 fspeed = fhead.hsz.spi_freg;
	// Установка:
	// SPI Flash Interface (0 = QIO, 1 = QOUT, 2 = DIO, 0x3 = DOUT)
	// and Speed QSPI: 0 = 40MHz, 1= 26MHz, 2 = 20MHz, ... = 80MHz
	sflash_something(fspeed);
	// SPIFlashCnfig(fhead.spi_interface & 3, (speed > 2)? 1 : speed + 2);
	// SPIReadModeCnfig(5); // in ROM
	// Всё - включаем кеширование, далее можно вызывать процедуры из flash
	Cache_Read_Enable_def();
}
#endif
//=============================================================================
// call_user_start() - вызывается из заголовка, загрузчиком
// Default entry point:  ENTRY(call_user_start) in eagle.app.v6.ld
//-----------------------------------------------------------------------------
void call_user_start(void)
{
		// Инициализация QSPI
		set_qspi_flash_cache();
		// Инициализация
		startup();
		// Очистка стека и передача управления в ROM-BIOS
		asm volatile (
				"movi	a2, 1;"
				"slli   a1, a2, 30;"
				);
		ets_run();
}
//=============================================================================
// ROM-BIOS запускает код с адреса 0x40100000
// при опцииях перезагрузки 'Jump Boot', если:
// GPIO0 = "0", GPIO1 = "1", GPIO2 = "0" (boot mode:(2,x))
// jump_boot() перенесено в main-vectors.c
//-----------------------------------------------------------------------------
#ifdef USE_RAPID_LOADER
typedef void (*tloader)(uint32 addr);
#else
void ICACHE_FLASH_ATTR loader(uint32 addr)
{
	__asm__ __volatile__ (
		"l32i.n	a3, a2, 0\n"	// SPIFlashHeader.head : bit0..7: = 0xE9, bit8..15: Number of segments, ...
		"l32i.n	a7, a2, 4\n"	// Entry point
		"extui	a3, a3, 8, 4\n" // Number of segments & 0x0F
		"addi.n	a2, a2, 8\n"	// p SPIFlashHeadSegment
		"j		4f\n"
	"1:\n"
		"l32i.n	a5, a2, 0\n"	// Memory offset
		"addi.n	a4, a2, 8\n"	// p start data
		"l32i.n	a2, a2, 4\n"	// Segment size
		"srli	a2, a2, 2\n"	// size >> 2
		"addx4	a2, a2, a4\n"	// + (size >> 2)
		"j		3f\n"
	"2:\n"
		"l32i.n	a6, a4, 0\n"	// flash data
		"addi.n	a4, a4, 4\n"
		"s32i.n	a6, a5, 0\n"	// Memory data
		"addi.n	a5, a5, 4\n"
	"3:\n"
		"bne	a2, a4, 2b\n"	// next SPIFlashHeadSegment != cur
		"4:\n"
		"addi.n	a3, a3, -1\n"	// Number of segments - 1
		"bnei	a3, -1, 1b\n"	// end segments ?

