pvvx/esp8266web/app/sdklib/system/app_main.c
#elif DEF_SDK_VERSION >= 1410
	if(buf[sys_const_freq_correct_en] == 3) g_ic.c[471] = 1; // esp_init_data_default: freq_correct_en[112]
	else g_ic.c[471] = 0;
#endif
	buf[0xf8] = 0;
	phy_rx_gain_dc_table = &buf[0x100];
	phy_rx_gain_dc_flag = 0;
	// **
	// user_rf_pre_init(); // не использется, т.к. мождно вписать что угодно и тут :)
    //	system_phy_set_powerup_option(0);
	//	system_phy_set_rfoption(1);
	// **
#elif DEF_SDK_VERSION >= 1300
	uint8 *buf = (uint8 *)os_malloc(256); // esp_init_data_default.bin
	spi_flash_read(esp_init_data_default_faddr,(uint32 *)buf, esp_init_data_default_size); // esp_init_data_default.bin
#else
	uint8 *buf = (uint8 *)os_malloc(esp_init_data_default_size); // esp_init_data_default.bin
	spi_flash_read(esp_init_data_default_faddr,(uint32 *)buf, esp_init_data_default_size); // esp_init_data_default.bin
#endif
	//
	if(buf[0] != 5) { // первый байт esp_init_data_default.bin не равен 5 ? - бардак!
#ifdef DEBUG_UART
		os_printf("\nError esp_init_data! Set default.\n");
#endif
		ets_memcpy(buf, esp_init_data_default, esp_init_data_default_size);
	}
//	system_restoreclock(); // STARTUP_CPU_CLK
	init_wifi(buf, info.st_mac); // инициализация WiFi
#if DEF_SDK_VERSION >= 1400
	if(buf[0xf8] == 1 || phy_rx_gain_dc_flag == 1) { // сохранить новые калибровки RF/VCC33 ?
#ifdef DEBUG_UART
		os_printf("\nSave rx_gain_dc table (%u, %u)\n", buf[0xf8], phy_rx_gain_dc_flag );
#endif
		wifi_param_save_protect_with_check(fsec_esp_init_data_default, flashchip_sector_size, buf, SIZE_SAVE_SYS_CONST);
	}
#endif
	os_free(buf);
	//
#if DEF_SDK_VERSION >= 1400 // (SDK 1.4.0)
	system_rtc_mem_read(0, &rst_if, sizeof(rst_if));
//	os_printf("RTC_MEM(0) = %u,%u,%p \n", rst_if.reason, IO_RTC_SCRATCH0, RTC_RAM_BASE[0x78>>2]);
#if DEF_SDK_VERSION >= 1520
	{
		uint32 reset_reason = IO_RTC_SCRATCH0;
		if(reset_reason >= REASON_EXCEPTION_RST && reset_reason < REASON_DEEP_SLEEP_AWAKE) {
			// reset_reason == REASON_EXCEPTION_RST, REASON_SOFT_WDT_RST, REASON_SOFT_RESTART, REASON_DEEP_SLEEP_AWAKE
			TestStaFreqCalValInput = RTC_RAM_BASE[0x78>>2]>>16;
			chip_v6_set_chan_offset(1, TestStaFreqCalValInput);
		}
		else {
			TestStaFreqCalValInput = 0;
			RTC_RAM_BASE[0x78>>2] &= 0xFFFF;
			if(reset_reason == REASON_DEFAULT_RST) {
				reset_reason = rtc_get_reset_reason();
				if(reset_reason == 1) { // =1 - ch_pd
					ets_memset(&rst_if, 0, sizeof(rst_if)); // rst_if.reason = REASON_DEFAULT_RST
				}
				else if(reset_reason == 2) { // =2 - reset
					if(rst_if.reason != REASON_DEEP_SLEEP_AWAKE
					 ||	rst_if.epc1 != 0
					 || rst_if.excvaddr != 0) {
						ets_memset(&rst_if, 0, sizeof(rst_if));
						rst_if.reason = REASON_EXT_SYS_RST;
						RTC_MEM(0) = REASON_EXT_SYS_RST;
					}
				}
			}
			else if(reset_reason > REASON_EXT_SYS_RST) {
				ets_memset(&rst_if, 0, sizeof(rst_if)); // rst_if.reason = REASON_DEFAULT_RST
			}
		}
	}
#else
	if (rst_if.reason >= REASON_EXCEPTION_RST && rst_if.reason < REASON_DEEP_SLEEP_AWAKE) { // >= 2 < 5
		// 2,3,4 REASON_EXCEPTION_RST, REASON_SOFT_WDT_RST, REASON_SOFT_RESTART
		TestStaFreqCalValInput = RTC_RAM_BASE[0x78>>2]>>16; // *((volatile uint32 *)0x60001078) >> 16
		chip_v6_set_chan_offset(1, TestStaFreqCalValInput);
	}
	else {
		TestStaFreqCalValInput = 0;
		RTC_RAM_BASE[0x78>>2] &= 0xFFFF; // *((volatile uint32 *)0x60001078) &= &0xFFFF;
		if(rst_if.reason > REASON_EXT_SYS_RST) rst_if.reason = REASON_DEFAULT_RST;
		if(rst_if.reason != REASON_DEEP_SLEEP_AWAKE && rtc_get_reset_reason() == 2) {
			rst_if.reason = REASON_EXT_SYS_RST; // = 6
		}
//		else if(rst_if.reason == REASON_WDT_RST && rtc_get_reset_reason() == 1) rst_if.reason = REASON_DEFAULT_RST;
	}
#endif
	//
#ifdef DEBUG_UART
	os_print_reset_error(); // вывод фатальных ошибок, вызвавших рестарт. см. в модуле wdt
#endif
	RTC_MEM(0) = REASON_DEFAULT_RST; //	вместо system_rtc_mem_write(0, &rst_if, sizeof(rst_if));
#endif
#endif	// DEF_SDK_VERSION >= 2000
//	DPORT_BASE[0] = (DPORT_BASE[0] & 0x60) | 0x0F; // ??
#if DEF_SDK_VERSION >= 1119 // (SDK 1.1.1)
	wdt_init(1);
#else
	wdt_init();
#endif
#ifdef DEBUG_UART
	uart_wait_tx_fifo_empty();
#endif
	user_init();
	user_init_flag = true;
#if DEF_SDK_VERSION >= 1200
	ets_timer_disarm(&check_timeouts_timer);
	ets_timer_arm_new(&check_timeouts_timer, lwip_timer_interval, 1, 1);
#endif
	WDT_FEED = WDT_FEED_MAGIC; // WDT
	//
	int wfmode = g_ic.g.wifi_store.wfmode[0]; // g_ic.c[0x214] (+532) SDK 1.2.0 // SDK 1.3.0 g_ic.c[472]
	wifi_mode_set(wfmode);
	if(wfmode & 1)  wifi_station_start();
#if DEF_SDK_VERSION >= 1200
	if(wfmode == 2) {
#if DEF_SDK_VERSION >= 1400
		if(g_ic.c[470] != 2) wifi_softap_start(0);
#else
		if(g_ic.c[446] != 2) wifi_softap_start(0);
#endif
		else wifi_softap_start(1);
	}
	else if(wfmode == 3) {
		wifi_softap_start(0);
	}
#else
	if(wfmode & 2)  wifi_softap_start();
#endif

#if DEF_SDK_VERSION >= 1110
	if(wfmode == 1) netif_set_default(*g_ic.g.netif1);	// struct netif *
#else
	if(wfmode) {
		struct netif * * p;
		if(wfmode == 1) p = g_ic.g.netif1; // g_ic+0x10;
		else p = g_ic.g.netif2; // g_ic+0x14;
		netif_set_default(*p);	// struct netif *
	}
#endif
	if(wifi_station_get_auto_connect()) wifi_station_connect();
	if(done_cb != NULL) done_cb();
}
//-----------------------------------------------------------------------------
#ifdef DEBUG_UART
void ICACHE_FLASH_ATTR puts_buf(uint8 ch)
{
	if(UartDev.trx_buff.TrxBuffSize < (TX_BUFF_SIZE-1)) {
		UartDev.trx_buff.pTrxBuff[UartDev.trx_buff.TrxBuffSize++] = ch;
		UartDev.trx_buff.pTrxBuff[UartDev.trx_buff.TrxBuffSize] = 0;
	}
}
#endif
//=============================================================================
// init_wifi()
//-----------------------------------------------------------------------------
const char aFATAL_ERR_R6PHY[] ICACHE_RODATA_ATTR = "register_chipv6_phy";
void ICACHE_FLASH_ATTR init_wifi(uint8 * init_data, uint8 * mac)
{
#ifdef DEBUG_UART
	uart_wait_tx_fifo_empty();
	UartDev.trx_buff.TrxBuffSize = 0;
	ets_install_putc1(puts_buf);
#endif
	if(register_chipv6_phy(init_data)){
		fatal_error(FATAL_ERR_R6PHY, init_wifi, (void *)aFATAL_ERR_R6PHY);
	}
#ifdef DEBUG_UART
	startup_uart_init();
	if(UartDev.trx_buff.TrxBuffSize) os_printf_plus(UartDev.trx_buff.pTrxBuff);
	UartDev.trx_buff.TrxBuffSize = TX_BUFF_SIZE;
#endif
	phy_disable_agc();
	ieee80211_phy_init(g_ic.g.wifi_store.phy_mode); // phy_mode
	lmacInit();
	wDev_Initialize(mac);
	pp_attach();
	ieee80211_ifattach(&g_ic);
	ets_isr_attach(0, wDev_ProcessFiq, NULL);
	ets_isr_unmask(1);
	pm_attach();
	fpm_attach();
	phy_enable_agc();
	cnx_attach(&g_ic);
	wDevEnableRx();
}
//=============================================================================
// uart_wait_tx_fifo_empty()
//-----------------------------------------------------------------------------
void ICACHE_FLASH_ATTR uart_wait_tx_fifo_empty(void)
{
	while((UART0_STATUS >> UART_TXFIFO_CNT_S) & UART_TXFIFO_CNT);
	while((UART1_STATUS >> UART_TXFIFO_CNT_S) & UART_TXFIFO_CNT);
}
//=============================================================================
// user_uart_wait_tx_fifo_empty()
// Use SDK Espressif
//-----------------------------------------------------------------------------
void user_uart_wait_tx_fifo_empty(uint32 uart_num, uint32 x)
{
	if(uart_num) while((UART1_STATUS >> UART_TXFIFO_CNT_S) & UART_TXFIFO_CNT);
	else while(((UART0_STATUS >> UART_TXFIFO_CNT_S) & UART_TXFIFO_CNT) && (x--));
}
